/* automatically generated by rust-bindgen 0.71.1 */

pub const REC_VERSION_MAJOR: u32 = 1;
pub const REC_VERSION_MINOR: u32 = 0;
pub const REC_VERSION_STRING: &[u8; 4] = b"1.0\0";
pub const MSET_ANY: u32 = 0;
pub const REC_FNAME_RE: &[u8; 23] = b"[a-zA-Z%][a-zA-Z0-9_]*\0";
pub const REC_TYPE_NAME_RE: &[u8; 23] = b"[a-zA-Z][a-zA-Z0-9_-]*\0";
pub const REC_URL_REGEXP: &[u8; 31] = b"(file|http|ftp|https)://[^ \t]+\0";
pub const REC_FILE_REGEXP: &[u8; 14] = b"(/?[^/ \t\n]+)+\0";
pub const REC_FNAME_FEX_RE: &[u8; 50] = b"[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?\0";
pub const REC_FNAME_LIST_RE: &[u8; 54] =
    b"[a-zA-Z%][a-zA-Z0-9_]*([ \n\t]+[a-zA-Z%][a-zA-Z0-9_]*)*\0";
pub const REC_FNAME_LIST_CS_RE : & [u8 ; 103] = b"[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?(,[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?)*\0" ;
pub const REC_FNAME_SUB_RE: &[u8; 73] =
    b"[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?(\\[[0-9]+(-[0-9]+)?\\])?\0";
pub const REC_FEX_FUNCTION_NAME: &[u8; 23] = b"[a-zA-Z_][a-zA-Z0-9_]*\0";
pub const REC_FEX_CALL: &[u8; 76] =
    b"[a-zA-Z_][a-zA-Z0-9_]*\\([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?\\)\0";
pub const REC_FNAME_LIST_SUB_ELEM_RE : & [u8 ; 204] = b"([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?(\\[[0-9]+(-[0-9]+)?\\])?|[a-zA-Z_][a-zA-Z0-9_]*\\([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?\\))(:[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?)?\0" ;
pub const REC_FNAME_LIST_SUB_RE : & [u8 ; 411] = b"([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?(\\[[0-9]+(-[0-9]+)?\\])?|[a-zA-Z_][a-zA-Z0-9_]*\\([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?\\))(:[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?)?(,([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?(\\[[0-9]+(-[0-9]+)?\\])?|[a-zA-Z_][a-zA-Z0-9_]*\\([a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?\\))(:[a-zA-Z%][a-zA-Z0-9_]*(\\.[a-zA-Z%][a-zA-Z0-9_]*)?)?)*\0" ;
pub const MSET_FIELD: u32 = 1;
pub const MSET_COMMENT: u32 = 2;
pub const REC_RECORD_TYPE_RE: &[u8; 23] = b"[a-zA-Z%][a-zA-Z0-9_]*\0";
pub const MSET_RECORD: u32 = 1;
pub const REC_F_DESCRIPTOR: u32 = 1;
pub const REC_F_ICASE: u32 = 2;
pub const REC_F_UNIQ: u32 = 4;
pub const REC_F_NOAUTO: u32 = 8;
pub const REC_F_COMMENT_OUT: u32 = 16;
pub const REC_SET_ACT_NONE: u32 = 0;
pub const REC_SET_ACT_RENAME: u32 = 1;
pub const REC_SET_ACT_SET: u32 = 2;
pub const REC_SET_ACT_ADD: u32 = 3;
pub const REC_SET_ACT_SETADD: u32 = 4;
pub const REC_SET_ACT_DELETE: u32 = 5;
pub const REC_SET_ACT_COMMENT: u32 = 6;
pub const REC_ENCRYPTED_PREFIX: &[u8; 11] = b"encrypted-\0";
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __darwin_off_t = __int64_t;
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::std::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::std::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::std::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::std::mem::offset_of!(__sbuf, _size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::std::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::std::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::std::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::std::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::std::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::std::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::std::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::std::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::std::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::std::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::std::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::std::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::std::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::std::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::std::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::std::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::std::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::std::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::std::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::std::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::std::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::std::mem::offset_of!(__sFILE, _offset) - 144usize];
};
pub type FILE = __sFILE;
unsafe extern "C" {
    pub fn rec_init();
}
unsafe extern "C" {
    pub fn rec_fini();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rec_mset_s {
    _unused: [u8; 0],
}
pub type rec_mset_t = *mut rec_mset_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rec_mset_elem_s {
    _unused: [u8; 0],
}
pub type rec_mset_elem_t = *mut rec_mset_elem_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rec_mset_list_iter_t {
    pub vtable: *mut ::std::os::raw::c_void,
    pub list: *mut ::std::os::raw::c_void,
    pub count: usize,
    pub p: *mut ::std::os::raw::c_void,
    pub q: *mut ::std::os::raw::c_void,
    pub i: usize,
    pub j: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rec_mset_list_iter_t"][::std::mem::size_of::<rec_mset_list_iter_t>() - 56usize];
    ["Alignment of rec_mset_list_iter_t"][::std::mem::align_of::<rec_mset_list_iter_t>() - 8usize];
    ["Offset of field: rec_mset_list_iter_t::vtable"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, vtable) - 0usize];
    ["Offset of field: rec_mset_list_iter_t::list"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, list) - 8usize];
    ["Offset of field: rec_mset_list_iter_t::count"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, count) - 16usize];
    ["Offset of field: rec_mset_list_iter_t::p"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, p) - 24usize];
    ["Offset of field: rec_mset_list_iter_t::q"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, q) - 32usize];
    ["Offset of field: rec_mset_list_iter_t::i"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, i) - 40usize];
    ["Offset of field: rec_mset_list_iter_t::j"]
        [::std::mem::offset_of!(rec_mset_list_iter_t, j) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rec_mset_iterator_t {
    pub mset: rec_mset_t,
    pub list_iter: rec_mset_list_iter_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rec_mset_iterator_t"][::std::mem::size_of::<rec_mset_iterator_t>() - 64usize];
    ["Alignment of rec_mset_iterator_t"][::std::mem::align_of::<rec_mset_iterator_t>() - 8usize];
    ["Offset of field: rec_mset_iterator_t::mset"]
        [::std::mem::offset_of!(rec_mset_iterator_t, mset) - 0usize];
    ["Offset of field: rec_mset_iterator_t::list_iter"]
        [::std::mem::offset_of!(rec_mset_iterator_t, list_iter) - 8usize];
};
pub type rec_mset_disp_fn_t =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
pub type rec_mset_equal_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        data1: *mut ::std::os::raw::c_void,
        data2: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
pub type rec_mset_dup_fn_t = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
>;
pub type rec_mset_compare_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        data1: *mut ::std::os::raw::c_void,
        data2: *mut ::std::os::raw::c_void,
        type2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type rec_mset_type_t = ::std::os::raw::c_int;
unsafe extern "C" {
    #[doc = " Creating and destroying multi-sets"]
    pub fn rec_mset_new() -> rec_mset_t;
}
